Webservice/app/controllers/stops_controller.rb

SELECT "stops".* FROM "stops"
---
  def index
    @stops = Stop.all