Webservice/app/controllers/warnings_controller.rb

SELECT "warnings".* FROM "warnings" WHERE (longitude <= -18.155270604577495 AND longitude >= -218.15527060457748) AND (latitude <= 133.7819490119121 AND latitude >= -66.2180509880879)
---
  def index

    @radius = params[:radius].to_f / 1000

    @lonMin = params[:longitude].to_f - @radius
    @latMin = params[:latitude].to_f - @radius

    @lonMax = params[:longitude].to_f + @radius
    @latMax = params[:latitude].to_f + @radius

    @warnings = Warning.where("longitude <= ? AND longitude >= ?", @lonMax, @lonMin)
           .where("latitude <= ? AND latitude >= ?", @latMax, @latMin)

INSERT INTO "warnings" ("created_at", "description", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 19 Jun 2014 08:33:38 UTC +00:00], ["description", "test"], ["latitude", 2.0], ["longitude", 3.0], ["updated_at", Thu, 19 Jun 2014 08:33:38 UTC +00:00]]
---
  def create
    @warning = Warning.new(warning_params)

    if @warning.save